{
  "animals": [
    "Cows have best friends.",
    "A group of owls is called a parliament.",
    "Kangaroos cannot walk backward.",
    "Elephants are the only animals that can't jump.",
    "A newborn kangaroo is the size of a lima bean.",
    "The tongue of a blue whale weighs as much as an elephant.",
    "Honeybees can recognize human faces.",
    "Male seahorses give birth to their offspring.",
    "A group of jellyfish is called a smack.",
    "Sloths only poop once a week.",
    "Cheetahs can accelerate from 0 to 60 mph faster than most sports cars.",
    "Armadillos can roll into a ball for self-defense.",
    "A mantis shrimp's punch is as fast as a .22 caliber bullet.",
    "Starfish don't have brains.",
    "The oldest known breed of domesticated dog is the Saluki.",
    "Koalas have fingerprints similar to humans.",
    "A group of flamingos is called a flamboyance.",
    "Turkeys can blush.",
    "Polar bear skin is black, and their fur is not actually white.",
    "A hedgehog's heart beats 300 times per minute.",
    "A newborn kangaroo is the size of a lima bean.",
    "A group of butterflies is called a flutter.",
    "Gorillas can catch human colds and other illnesses.",
    "The world's smallest mammal is the bumblebee bat.",
    "Alligators can live up to 100 years.",
    "A single elephant tooth can weigh as much as 9 pounds.",
    "A snail can sleep for three years.",
    "The fingerprints of a koala are so indistinguishable from humans that they have on occasion been confused at a crime scene.",
    "A group of penguins is called a colony.",
    "An adult giraffe's tongue can be up to 45 cm long.",
    "The only mammal capable of flight is the bat.",
    "Seahorses mate for life and hold each other's tails.",
    "A group of whales is called a pod.",
    "The slowest mammal is the three-toed sloth, moving at a speed of 0.03 mph.",
    "A group of frogs is called an army.",
    "A crocodile cannot stick its tongue out.",
    "The electric eel can produce shocks of up to 600 volts.",
    "A group of ravens is called a murder.",
    "The cheetah is the only big cat that cannot roar.",
    "A newborn kangaroo is the size of a lima bean.",
    "Polar bear skin is black, and their fur is not actually white.",
    "The world's smallest mammal is the bumblebee bat.",
    "Alligators can live up to 100 years.",
    "A single elephant tooth can weigh as much as 9 pounds.",
    "A snail can sleep for three years.",
    "The fingerprints of a koala are so indistinguishable from humans that they have on occasion been confused at a crime scene.",
    "A group of penguins is called a colony.",
    "An adult giraffe's tongue can be up to 45 cm long.",
    "The only mammal capable of flight is the bat.",
    "Seahorses mate for life and hold each other's tails.",
    "A group of whales is called a pod.",
    "The slowest mammal is the three-toed sloth, moving at a speed of 0.03 mph.",
    "A group of frogs is called an army.",
    "A crocodile cannot stick its tongue out.",
    "The electric eel can produce shocks of up to 600 volts.",
    "A group of ravens is called a murder.",
    "The cheetah is the only big cat that cannot roar.",
    "A group of ferrets is called a business.",
    "The mimic octopus can imitate the appearance and behavior of more than 15 different marine species.",
    "A group of zebras is called a dazzle.",
    "The Hercules beetle can lift objects over 850 times its own weight.",
    "The blue whale's heart is so big that a human could swim through its arteries.",
    "Cats have five toes on their front paws but only four on their back paws.",
    "An ostrich's eye is bigger than its brain.",
    "A group of porcupines is called a prickle.",
    "The tongue of a chameleon is twice the length of its body.",
    "The only mammals capable of flight are bats.",
    "A group of crows is called a murder.",
    "A newborn kangaroo is the size of a lima bean.",
    "Polar bear skin is black, and their fur is not actually white.",
    "The world's smallest mammal is the bumblebee bat.",
    "Alligators can live up to 100 years.",
    "A single elephant tooth can weigh as much as 9 pounds.",
    "A snail can sleep for three years.",
    "The fingerprints of a koala are so indistinguishable from humans that they have on occasion been confused at a crime scene.",
    "A group of penguins is called a colony.",
    "An adult giraffe's tongue can be up to 45 cm long.",
    "The only mammal capable of flight is the bat.",
    "Seahorses mate for life and hold each other's tails.",
    "A group of whales is called a pod.",
    "The slowest mammal is the three-toed sloth, moving at a speed of 0.03 mph.",
    "A group of frogs is called an army.",
    "A crocodile cannot stick its tongue out.",
    "The electric eel can produce shocks of up to 600 volts.",
    "A group of ravens is called a murder.",
    "The cheetah is the only big cat that cannot roar.",
    "A group of ferrets is called a business.",
    "The mimic octopus can imitate the appearance and behavior of more than 15 different marine species.",
    "A group of zebras is called a dazzle.",
    "The Hercules beetle can lift objects over 850 times its own weight.",
    "The blue whale's heart is so big that a human could swim through its arteries.",
    "Cats have five toes on their front paws but only four on their back paws.",
    "An ostrich's eye is bigger than its brain.",
    "A group of porcupines is called a prickle.",
    "The tongue of a chameleon is twice the length of its body.",
    "The only mammals capable of flight are bats.",
    "A group of crows is called a murder.",
    "A newborn kangaroo is the size of a lima bean.",
    "Polar bear skin is black, and their fur is not actually white.",
    "The world's smallest mammal is the bumblebee bat."
  ],
  "technology": [
    "The first computer mouse was made of wood.",
    "The average person spends 6 months of their lifetime waiting for red lights to turn green.",
    "The first email was sent in 1971 by Ray Tomlinson.",
    "The first webcam was used to monitor a coffee pot at Cambridge University.",
    "The first computer virus was created in 1983.",
    "The world's first computer programmer was Ada Lovelace in the 1800s.",
    "The first mobile phone call was made in 1973.",
    "The Apollo 11 guidance computer had less processing power than a modern smartphone.",
    "The world's first 1GB hard drive was announced in 1980 and weighed 550 pounds.",
    "The QWERTY keyboard layout was designed to prevent typewriters from jamming.",
    "The first computer bug was a real insect - a moth found inside a Harvard Mark II computer in 1947.",
    "The term 'bug' in software comes from Grace Hopper finding an actual moth in her computer.",
    "The first domain name ever registered was 'symbolics.com.'",
    "The concept of the World Wide Web was proposed by Tim Berners-Lee in 1989.",
    "The first video uploaded to YouTube was titled 'Me at the Zoo.'",
    "The first 1GB SD card was released in 2004, costing $500.",
    "The world's first computer was the ENIAC, completed in 1945.",
    "The term 'Wi-Fi' doesn't stand for anything; it's a trademarked brand name.",
    "The first computer virus in the wild was discovered in 1986, called 'Brain.'",
    "The first computer programming language was Fortran, created in the 1950s.",
    "The computer mouse was invented by Doug Engelbart in 1964.",
    "The average computer user blinks seven times per minute, compared to a normal rate of 20.",
    "The first known computer programmer was Ada Lovelace, who wrote programs for Charles Babbage's Analytical Engine in the 1800s.",
    "The first computer game was created in 1958, named 'Tennis for Two.'",
    "The average person spends about 2 years of their life on the phone.",
    "The first commercially available computer mouse was the 'Xerox 8010 Star Information System' in 1981.",
    "The first computer password was 'login.'",
    "The world's first computer virus was created in 1983.",
    "The first mobile phone call was made in 1973.",
    "The first computer-generated animation was created in 1961, named 'Orbits.'",
    "The first computer hard drive was the IBM 305 RAMAC, released in 1956.",
    "The world's first computer programmer was Ada Lovelace in the 1800s.",
    "The first computer mouse was made of wood.",
    "The average person spends 6 months of their lifetime waiting for red lights to turn green.",
    "The first email was sent in 1971 by Ray Tomlinson.",
    "The first webcam was used to monitor a coffee pot at Cambridge University.",
    "The first computer virus was created in 1983.",
    "The world's first 1GB hard drive was announced in 1980 and weighed 550 pounds.",
    "The QWERTY keyboard layout was designed to prevent typewriters from jamming.",
    "The first computer bug was a real insect - a moth found inside a Harvard Mark II computer in 1947.",
    "The term 'bug' in software comes from Grace Hopper finding an actual moth in her computer.",
    "The first domain name ever registered was 'symbolics.com.'",
    "The concept of the World Wide Web was proposed by Tim Berners-Lee in 1989.",
    "The first video uploaded to YouTube was titled 'Me at the Zoo.'",
    "The first 1GB SD card was released in 2004, costing $500.",
    "The world's first computer was the ENIAC, completed in 1945.",
    "The term 'Wi-Fi' doesn't stand for anything; it's a trademarked brand name.",
    "The first computer virus in the wild was discovered in 1986, called 'Brain.'",
    "The first computer programming language was Fortran, created in the 1950s.",
    "The computer mouse was invented by Doug Engelbart in 1964.",
    "The average computer user blinks seven times per minute, compared to a normal rate of 20.",
    "The first known computer programmer was Ada Lovelace, who wrote programs for Charles Babbage's Analytical Engine in the 1800s.",
    "The first computer game was created in 1958, named 'Tennis for Two.'",
    "The average person spends about 2 years of their life on the phone.",
    "The first commercially available computer mouse was the 'Xerox 8010 Star Information System' in 1981.",
    "The first computer password was 'login.'",
    "The world's first computer virus was created in 1983.",
    "The first mobile phone call was made in 1973.",
    "The first computer-generated animation was created in 1961, named 'Orbits.'",
    "The first computer hard drive was the IBM 305 RAMAC, released in 1956.",
    "The first computer programmer was Ada Lovelace in the 1800s.",
    "The first computer mouse was invented in 1964 by Doug Engelbart.",
    "The world's first webcam was used at Cambridge University in 1993.",
    "The average computer mouse travels 56 miles of distance in a year.",
    "The first computer virus was created in 1983.",
    "The QWERTY keyboard layout was designed to slow down typing and prevent jamming of early typewriters.",
    "The term 'bug' for computer errors originated in 1947 when a moth caused a malfunction.",
    "The Apollo 11 guidance computer had less processing power than a modern-day calculator.",
    "The first smartphone, IBM Simon, was introduced in 1992.",
    "The term 'Wi-Fi' doesn't stand for anything; it is a brand name.",
    "The first computer mouse was made of wood.",
    "The first email was sent in 1971 by Ray Tomlinson.",
    "The first website went live in 1991.",
    "The first computer virus for PCs was the Brain virus, created in 1986.",
    "The term 'hackathon' is a portmanteau of 'hack' and 'marathon.'",
    "The world's first 1TB SSD was released in 2008.",
    "The first 1GB hard drive was announced in 1980 and weighed about 550 pounds.",
    "The world's first computer, the ENIAC, weighed about 27 tons.",
    "The first programmable computer was the Z3, created by Konrad Zuse in 1941.",
    "The computer mouse was originally called the 'X-Y Position Indicator for a Display System.'",
    "The first computer virus distributed in the wild was the Morris Worm in 1988.",
    "The term 'bug' for computer glitches was coined by Grace Hopper in 1947.",
    "The QR code was invented by Masahiro Hara in 1994.",
    "The first video game, 'Tennis for Two,' was created in 1958.",
    "The first computer with a graphical user interface (GUI) was the Xerox Alto in 1973.",
    "The first 1TB hard drive was released in 2007.",
    "The first webcam was used to monitor a coffee pot at Cambridge University.",
    "The world's first computer programmer was Ada Lovelace in the 1840s.",
    "The first computer virus, named 'Creeper,' was created in 1971.",
    "The first computer mouse was invented by Douglas Engelbart in 1964.",
    "The first computer-generated music was created by Alan Turing in 1951.",
    "The first domain name ever registered was 'symbolics.com' in 1985.",
    "The first digital camera was created by Kodak engineer Steve Sasson in 1975.",
    "The first 1GB hard drive was introduced by IBM in 1980.",
    "The first computer bug was a moth caught in the Harvard Mark II in 1947.",
    "The first computer virus for PCs, Brain, was created in 1986.",
    "The first computer game, 'Spacewar!', was created in 1962.",
    "The first computer virus to cause significant damage was the Morris Worm in 1988.",
    "The first computer mouse was made of wood in 1964.",
    "The first emoticon, :-) was used in 1982.",
    "The first computer mouse was called 'X-Y Position Indicator for a Display System.'",
    "The first computer programmer, Ada Lovelace, wrote the first algorithm in the 1840s.",
    "The first computer virus, 'Creeper,' displayed the message 'I'm the creeper, catch me if you can!'",
    "The first computer mouse was invented by Douglas Engelbart in 1964."
  ],
  "science": [
    "The Earth's core is as hot as the surface of the sun.",
    "Astronauts grow up to 2 inches taller in space due to microgravity.",
    "Cats and dogs can both understand human emotions.",
    "The human brain is 73% water.",
    "Light takes approximately 8 minutes and 20 seconds to travel from the sun to Earth.",
    "The speed of light is about 299,792 kilometers per second.",
    "The only planet not named after a god is Earth.",
    "A day on Venus is longer than a year on Venus.",
    "There are more atoms in a single glass of water than glasses of water in all the oceans on Earth.",
    "One tablespoon of a neutron star would weigh about 6 billion tons.",
    "The longest recorded time between two twins being born is 87 days.",
    "The average person walks the equivalent of three times around the world in a lifetime.",
    "Honey is the only natural food that never spoils.",
    "The first computer programmer was Ada Lovelace, who wrote the first algorithm for Charles Babbage's Analytical Engine.",
    "The Great Wall of China is not visible from the moon without aid.",
    "A light year is about 5.88 trillion miles (9.46 trillion kilometers).",
    "The first 3D printer was created in 1983 by Chuck Hull.",
    "The human eye can distinguish about 10 million different colors.",
    "Hippopotomonstrosesquippedaliophobia is the fear of long words.",
    "A nanosecond lasts one billionth of a second.",
    "The coldest natural temperature ever directly recorded at ground level is −128.6°F (−89.2°C) in Antarctica.",
    "The human body has more bacteria cells than human cells.",
    "The Earth's atmosphere weighs about 5.5 quadrillion tons.",
    "A single rainforest can produce 20% of the Earth's oxygen.",
    "Bananas are berries, but strawberries aren't.",
    "If you were to stretch out all the DNA in your body, it would reach Pluto and back.",
    "A group of flamingos is called a flamboyance.",
    "The Eiffel Tower can be 15 cm taller during the summer due to thermal expansion.",
    "Jupiter's moon Ganymede is larger than the planet Mercury.",
    "Venus rotates in the opposite direction to most planets in our solar system.",
    "A day on Mars is 24.6 hours long.",
    "Diamonds can be turned into graphite under intense heat and pressure.",
    "The International Space Station travels at a speed of about 28,000 kilometers per hour (17,500 miles per hour).",
    "The largest volcano in our solar system is on Mars and is called Olympus Mons.",
    "Astronauts' height can change in microgravity.",
    "Sound cannot travel through a vacuum.",
    "The sun makes up 99.86% of the mass in our solar system.",
    "The world's largest desert is Antarctica.",
    "There are more possible iterations of a game of chess than there are atoms in the observable universe.",
    "The only planet in our solar system that rotates clockwise is Venus.",
    "The average human dream lasts only 2-3 seconds.",
    "The first photograph ever taken was in 1826 by Joseph Nicéphore Niépce.",
    "The most abundant gas in the Earth's atmosphere is nitrogen.",
    "Astronauts experience 'space sickness,' a form of motion sickness, when they first arrive in space.",
    "A group of owls is called a parliament.",
    "A single bolt of lightning contains enough energy to toast 100,000 slices of bread.",
    "The Earth is not a perfect sphere; it is slightly flattened at the poles and bulging at the equator.",
    "The northern lights (Aurora Borealis) can be seen from space.",
    "A human's sense of smell is capable of detecting around 1 trillion different odors.",
    "The first video game ever created was 'Tennis for Two' in 1958.",
    "The human body produces about 1 to 1.5 quarts (0.95 to 1.42 liters) of saliva each day.",
    "A newborn kangaroo is the size of a lima bean.",
    "The Earth travels through space at an average speed of about 67,000 miles per hour (108,000 kilometers per hour).",
    "The planet with the most gravity in our solar system is Jupiter.",
    "The largest ocean on Earth is the Pacific Ocean.",
    "The smell of freshly-cut grass is actually a plant distress call.",
    "Cleopatra lived closer to the moon landing than to the construction of the Great Pyramid.",
    "Vikings used a system of navigation called sun compass.",
    "The world's oldest known recipe is for beer.",
    "Astronauts' vision can be altered in microgravity.",
    "The world's smallest bone is in the human ear, called the stapes.",
    "The shortest war in history was between Britain and Zanzibar, lasting only 38 minutes.",
    "Owls are the only birds that can see the color blue.",
    "Kangaroos cannot walk backward.",
    "Elephants are the only animals that can't jump.",
    "A single cloud can weigh more than 1 million pounds.",
    "A newborn octopus is about the size of a flea.",
    "The average person will spend six months of their life waiting for red lights to turn green.",
    "The first known contraceptive was crocodile dung used by ancient Egyptians.",
    "The tallest tree ever recorded was an Australian eucalyptus named 'Centurion,' measuring 327 feet tall.",
    "The world's largest sand island is Fraser Island in Australia.",
    "The longest time a person has survived in space is 437 days (Valeri Polyakov).",
    "There are more possible iterations of a game of chess than there are atoms in the observable universe.",
    "A 'jiffy' is an actual unit of time, defined as the time it takes light to travel one centimeter in a vacuum (about 33.3564 picoseconds)."
  ],
  "programming": [
    "Programming is the art of telling a computer what to do through a set of instructions.",
    "JavaScript is not related to Java; they have different origins and purposes.",
    "Python's name is derived from the British comedy group Monty Python.",
    "The first computer programmer was Ada Lovelace in the 1800s.",
    "C is considered the mother of all programming languages.",
    "HTML is not a programming language; it's a markup language for web content.",
    "The first computer virus was created in 1983 and was called the 'Elk Cloner.'",
    "PHP originally stood for 'Personal Home Page' but now stands for 'Hypertext Preprocessor.'",
    "The first website went live in 1991.",
    "Java was originally named 'Oak' after an oak tree outside James Gosling's office.",
    "The 'Hello, World!' program is often the first program written by developers learning a new language.",
    "SQL stands for 'Structured Query Language.'",
    "The concept of Object-Oriented Programming (OOP) is based on the real-world entities.",
    "In programming, 'bug' originated from a moth found in the Harvard Mark II computer.",
    "Linus Torvalds created Linux in 1991.",
    "The first computer mouse was invented by Douglas Engelbart in 1964.",
    "Git, a version control system, was created by Linus Torvalds.",
    "The most popular programming language on GitHub is JavaScript.",
    "Java is one of the most popular programming languages and is used in billions of devices worldwide.",
    "The world's first computer programmer, Ada Lovelace, was the daughter of the poet Lord Byron.",
    "The concept of 'bit' (binary digit) was introduced by Claude Shannon in 1948.",
    "Grace Hopper coined the term 'bug' to describe a computer glitch.",
    "Linux is an open-source operating system kernel first created by Linus Torvalds.",
    "The first computer game, 'Spacewar!,' was developed in 1962.",
    "Python's creator, Guido van Rossum, was inspired by the British comedy group Monty Python.",
    "The 'printf' function in C stands for 'print formatted.'",
    "A 'byte' consists of 8 bits and can represent a single character in a computer.",
    "HTML5 is the latest version of the Hypertext Markup Language used for creating web pages.",
    "The first high-level programming language was Fortran, developed in the 1950s.",
    "The '404 Not Found' error code in web browsers indicates that the requested page was not found.",
    "JavaScript was created by Brendan Eich in 10 days.",
    "The concept of a 'cookie' in web development originated from programmer Lou Montulli.",
    "The World Wide Web Consortium (W3C) oversees web standards.",
    "The term 'hackathon' is a combination of 'hack' and 'marathon' and refers to collaborative coding events.",
    "The 'favicon' is the small icon displayed next to a website's name in the browser tab.",
    "Alan Turing is considered the father of theoretical computer science and artificial intelligence.",
    "In programming, 'grep' stands for 'Global Regular Expression Print.'",
    "The first computer virus in the wild was detected in 1986 and was called the 'Brain' virus.",
    "The 'open-source' concept allows the source code of a program to be freely available to the public.",
    "The 'cloud' in cloud computing represents the internet, and cloud services are hosted on remote servers.",
    "The 'Garbage Collector' in programming languages like Java and C# automatically frees up memory.",
    "The 'hash table' is a data structure that enables quick data retrieval using a key.",
    "The first widely used programming language was Fortran (Formula Translation) developed in the 1950s.",
    "In programming, 'API' stands for 'Application Programming Interface.'",
    "The 'Ctrl+C' keyboard shortcut for copying text originated from the CP/M operating system.",
    "In object-oriented programming, a 'class' is a blueprint for creating objects.",
    "The 'grep' command in Unix stands for 'Global Regular Expression Print.'",
    "The 'NaN' (Not a Number) value is a special value representing an undefined or unrepresentable value.",
    "The 'command line' is a text-based interface used for interacting with a computer's operating system.",
    "In programming, 'null' represents the absence of a value or a reference to no object.",
    "The first computer programmer, Ada Lovelace, worked on Charles Babbage's Analytical Engine.",
    "A 'compiler' translates high-level programming code into machine code for a specific processor.",
    "The 'favicon' is a small icon associated with a website, displayed in the browser tab and bookmarks.",
    "The '404 Not Found' error code in web browsers indicates that the requested page was not found on the server.",
    "The 'grep' command in Unix is used for searching text patterns in files.",
    "The concept of 'cloud computing' refers to delivering computing services, such as storage and processing power, over the internet.",
    "The term 'bug' in programming originated when a moth caused a malfunction in the Harvard Mark II computer.",
    "In programming, 'boolean' refers to a data type that can have only two values: true or false.",
    "The 'hash table' is a data structure used for quick data retrieval based on a key.",
    "In programming, 'API' stands for 'Application Programming Interface' and defines how software components should interact.",
    "The 'Hello, World!' program is a simple program that displays the message 'Hello, World!' and is often used as a beginner's introduction to coding.",
    "JavaScript, despite its name, has no relation to Java. It was developed by Netscape and originally named 'Mocha.'",
    "The concept of 'Open Source' allows developers to access and modify a program's source code, fostering collaboration and innovation.",
    "The first computer programmer was Ada Lovelace, who wrote the first algorithm intended for processing on Charles Babbage's Analytical Engine.",
    "In programming, 'recursion' is a technique where a function calls itself, often used for solving problems that can be broken down into simpler subproblems.",
    "A 'bit' is the smallest unit of data in computing and can represent either a 0 or a 1 in binary code.",
    "The 'command line' is a text-based interface for interacting with a computer's operating system, providing powerful tools and commands.",
    "JavaScript, often used for web development, was created by Brendan Eich in just 10 days while working at Netscape.",
    "The 'NaN' (Not a Number) value in programming is a special value representing an undefined or unrepresentable result of a mathematical operation.",
    "In programming, 'null' is a special value that represents the absence of a value or a reference to no object.",
    "The 'pipe' symbol (|) in Unix-like operating systems allows the output of one command to be used as the input for another.",
    "The 'byte' is a unit of digital information that consists of 8 bits and can represent a single character in a computer.",
    "The 'Ctrl+C' keyboard shortcut for copying text originated from the CP/M operating system and has become a standard in many systems.",
    "Grace Hopper, a pioneering computer scientist, is credited with coining the term 'bug' to describe a computer glitch.",
    "JavaScript, a versatile programming language, is commonly used for both client-side and server-side web development.",
    "The concept of 'cookies' in web development was introduced by programmer Lou Montulli to store small pieces of data on the user's device.",
    "In programming, 'grep' is a command-line utility used for searching text patterns in files and streams of data.",
    "The first computer mouse was invented by Douglas Engelbart in 1964 and was made of wood.",
    "The 'pipe' symbol (|) in Unix-like operating systems allows the output of one command to be used as the input for another command.",
    "The concept of 'Object-Oriented Programming' (OOP) is based on the idea of organizing code into reusable and self-contained objects.",
    "The '404 Not Found' error code in web browsers indicates that the requested page was not found on the server.",
    "In programming, 'null' represents the absence of a value or a reference to no object.",
    "The 'garbage collector' in programming languages like Java and C# automatically frees up memory by deallocating unused objects.",
    "The 'hash table' is a data structure that allows quick data retrieval based on a key, providing efficient search and retrieval operations.",
    "The concept of 'cloud computing' refers to the delivery of computing services, including storage and processing power, over the internet.",
    "The 'favicon' is a small icon associated with a website, displayed in the browser tab and bookmarks.",
    "The 'grep' command in Unix is used for searching text patterns in files and is a powerful tool for text processing.",
    "The term 'bug' in programming originated when a moth caused a malfunction in the Harvard Mark II computer.",
    "In programming, 'boolean' refers to a data type that can have only two values: true or false.",
    "The 'hash table' is a data structure used for quick data retrieval based on a key, making it efficient for search and retrieval operations.",
    "In programming, 'API' stands for 'Application Programming Interface' and defines how software components should interact.",
    "The 'Hello, World!' program is a simple program often used as a beginner's introduction to coding; it typically prints 'Hello, World!' to the console.",
    "JavaScript, despite its name, has no relation to Java. It was developed by Netscape and was originally named 'Mocha.'",
    "The concept of 'Open Source' allows developers to access and modify a program's source code, fostering collaboration and innovation.",
    "The first computer programmer was Ada Lovelace, who wrote the first algorithm intended for processing on Charles Babbage's Analytical Engine.",
    "In programming, 'recursion' is a technique where a function calls itself, often used for solving problems that can be broken down into simpler subproblems.",
    "A 'bit' is the smallest unit of data in computing and can represent either a 0 or a 1 in binary code.",
    "The 'command line' is a text-based interface for interacting with a computer's operating system, providing powerful tools and commands.",
    "JavaScript, often used for web development, was created by Brendan Eich in just 10 days while working at Netscape.",
    "The 'NaN' (Not a Number) value in programming is a special value representing an undefined or unrepresentable result of a mathematical operation.",
    "In programming, 'null' is a special value that represents the absence of a value or a reference to no object.",
    "The 'pipe' symbol (|) in Unix-like operating systems allows the output of one command to be used as the input for another.",
    "The 'byte' is a unit of digital information that consists of 8 bits and can represent a single character in a computer.",
    "The 'Ctrl+C' keyboard shortcut for copying text originated from the CP/M operating system and has become a standard in many systems.",
    "Grace Hopper, a pioneering computer scientist, is credited with coining the term 'bug' to describe a computer glitch.",
    "JavaScript, a versatile programming language, is commonly used for both client-side and server-side web development.",
    "The concept of 'cookies' in web development was introduced by programmer Lou Montulli to store small pieces of data on the user's device.",
    "In programming, 'grep' is a command-line utility used for searching text patterns in files and streams of data.",
    "The first computer mouse was invented by Douglas Engelbart in 1964 and was made of wood.",
    "The 'pipe' symbol (|) in Unix-like operating systems allows the output of one command to be used as the input for another command.",
    "The concept of 'Object-Oriented Programming' (OOP) is based on the idea of organizing code into reusable and self-contained objects.",
    "The '404 Not Found' error code in web browsers indicates that the requested page was not found on the server.",
    "In programming, 'null' represents the absence of a value or a reference to no object.",
    "The 'garbage collector' in programming languages like Java and C# automatically frees up memory by deallocating unused objects.",
    "The 'hash table' is a data structure that allows quick data retrieval based on a key, providing efficient search and retrieval operations.",
    "The concept of 'cloud computing' refers to the delivery of computing services, including storage and processing power, over the internet.",
    "The 'favicon' is a small icon associated with a website, displayed in the browser tab and bookmarks.",
    "The 'grep' command in Unix is used for searching text patterns in files and is a powerful tool for text processing.",
    "The term 'bug' in programming originated when a moth caused a malfunction in the Harvard Mark II computer.",
    "In programming, 'boolean' refers to a data type that can have only two values: true or false.",
    "The 'hash table' is a data structure used for quick data retrieval based on a key, making it efficient for search and retrieval operations.",
    "In programming, 'API' stands for 'Application Programming Interface' and defines how software components should interact.",
    "The 'Hello, World!' program is a simple program often used as a beginner's introduction to coding; it typically prints 'Hello, World!' to the console.",
    "JavaScript, despite its name, has no relation to Java. It was developed by Netscape and was originally named 'Mocha.'",
    "The concept of 'Open Source' allows developers to access and modify a program's source code, fostering collaboration and innovation.",
    "The first computer programmer was Ada Lovelace, who wrote the first algorithm intended for processing on Charles Babbage's Analytical Engine.",
    "In programming, 'recursion' is a technique where a function calls itself, often used for solving problems that can be broken down into simpler subproblems."
  ],
  "space": [
    "The largest volcano in our solar system is on Mars, called Olympus Mons.",
    "Jupiter is so massive that it could fit more than 1,300 Earths inside it.",
    "A day on Venus is longer than a year on Venus.",
    "The Milky Way galaxy is about 100,000 light-years in diameter.",
    "Neutron stars can spin at a rate of 600 rotations per second.",
    "Astronauts on the International Space Station witness about 16 sunrises and sunsets every day.",
    "The coldest place in the universe is on Earth. In a lab, scientists can achieve temperatures colder than space.",
    "Saturn would float in water because it has a lower density than water.",
    "The Sun makes up about 99.86% of the total mass of our solar system.",
    "There are more stars in the universe than there are grains of sand on all the beaches on Earth.",
    "If you shouted in space, no one would hear you, because space is a vacuum with no air.",
    "One teaspoon of a neutron star would weigh about 6 billion tons.",
    "The Voyager 1 spacecraft is the farthest human-made object from Earth, about 14 billion miles away.",
    "Astronauts' height can change in space due to the lack of gravity compressing their spines.",
    "The Hubble Space Telescope can see back in time, capturing images of galaxies billions of years old.",
    "The Great Red Spot on Jupiter is a massive storm that has been raging for at least 350 years.",
    "A day on Pluto is about 6.4 Earth days long.",
    "The Moon is gradually moving away from Earth at a rate of about 1.5 inches per year.",
    "Astronaut Alan Shepard played golf on the Moon during the Apollo 14 mission.",
    "The temperature on the Moon ranges from extremely hot (about 127 degrees Celsius) to extremely cold (about -173 degrees Celsius).",
    "There are more than 200 billion galaxies in the observable universe.",
    "The universe is about 13.8 billion years old.",
    "Black holes can be millions or billions of times more massive than our Sun.",
    "The first woman in space was Valentina Tereshkova from the Soviet Union in 1963.",
    "The nearest galaxy to us is the Andromeda Galaxy, about 2.5 million light-years away.",
    "The Kuiper Belt is a region in the solar system beyond Neptune that contains many dwarf planets, including Pluto.",
    "Astronauts experience 'space fever,' a form of motion sickness, during their first few days in space.",
    "There is a cloud of alcohol in Sagittarius B, a distant region of our Milky Way galaxy.",
    "The sun loses about 4 million tons of mass every second due to nuclear fusion.",
    "The total number of asteroids in our solar system is estimated to be in the millions.",
    "The temperature of the Sun's core is about 15 million degrees Celsius.",
    "The International Space Station travels at a speed of about 28,000 kilometers per hour (17,500 miles per hour).",
    "The word 'astronaut' comes from the Greek words 'astron,' meaning star, and 'nautes,' meaning sailor.",
    "A spoonful of a neutron star would weigh about 6 billion tons.",
    "The concept of a black hole was first theorized by physicist John Michell in a letter written to the Royal Society in 1783.",
    "Astronauts on the Moon's surface experience only about 17% of the gravity they feel on Earth.",
    "There is a giant diamond in space named BPM 37093, also known as 'Lucy' after the Beatles song.",
    "In space, there is no 'up' or 'down'; orientation is relative.",
    "The largest known star, UY Scuti, is so massive that it could fit over 1,700 times the diameter of the Sun.",
    "The Crab Nebula, a supernova remnant, was observed by Chinese astronomers in the year 1054.",
    "The 'Pillars of Creation' in the Eagle Nebula are massive columns of gas and dust where new stars are forming.",
    "The nearest star to our solar system, Proxima Centauri, is part of the Alpha Centauri star system.",
    "A day on Mars is only about 24.6 hours, very close to Earth's day length.",
    "Dark matter, which makes up about 27% of the universe, does not emit, absorb, or reflect light.",
    "The universe is expanding, and galaxies are moving away from each other over time.",
    "There are rogue planets drifting through space without being bound to any star.",
    "In 1977, the Voyager probes carried a golden record with sounds and images representing Earth in case they encountered extraterrestrial life.",
    "Space is not completely empty; it contains particles, radiation, and cosmic dust.",
    "The Sun's energy comes from nuclear fusion reactions in its core, where hydrogen atoms fuse to form helium.",
    "Astronauts' vision can be affected in space due to fluid shifts in the body affecting the eyes.",
    "Saturn's rings are made up of billions of particles, ranging from tiny specks to large chunks several meters in size."
  ],
  "rail": [
    "The first full-scale working railway steam locomotive was built by George Stephenson in 1804.",
    "The world's oldest operational railway is the Wagonway at Beamish Museum in England.",
    "The world's first public railway to use steam locomotives was the Stockton and Darlington Railway in 1825.",
    "The \"Rocket\" locomotive, designed by George Stephenson, was one of the first successful steam locomotives.",
    "The first scheduled passenger train service began in England in 1830.",
    "The Trans-Siberian Railway is the longest railway line in the world, stretching over 9,289 kilometers (5,772 miles).",
    "The world's first recorded railway death occurred in 1830 when William Huskisson was struck by a train during the opening ceremony of the Liverpool and Manchester Railway.",
    "The \"Golden Arrow\" was a luxury train that ran between London and Dover in the 1920s.",
    "The \"Orient Express\" was a famous luxury train service that operated between Paris and Istanbul.",
    "The \"Flying Scotsman\" is a renowned steam locomotive that set the world record for the longest non-stop run by a steam locomotive.",
    "Japan's Shinkansen, or bullet train, was the world's first high-speed railway line.",
    "The first subway system opened in London in 1863.",
    "The London Underground is the world's oldest underground railway system.",
    "The Channel Tunnel connects England and France by rail and is the longest underwater tunnel in the world.",
    "The \"Big Boy\" steam locomotive, built by the American Locomotive Company, is one of the largest ever built.",
    "\"Thomas the Tank Engine\" is a popular children's character from \"The Railway Series\" books.",
    "India has one of the largest railway networks in the world.",
    "The \"Pacific Express\" was the first passenger train service in South Africa.",
    "\"Railjet\" is a high-speed train service in Austria.",
    "The \"Palmetto Express\" is an Amtrak train that connects New York and Savannah.",
    "\"The Great Train Robbery\" was a famous heist on a Royal Mail train in the UK in 1963.",
    "The \"Bluebell Railway\" in England was one of the first preserved heritage railways.",
    "The \"Talyllyn Railway\" in Wales is one of the world's oldest preserved railways.",
    "\"Train Spotting\" is a hobby where enthusiasts observe and record train movements.",
    "\"Polar Express\" is a popular Christmas-themed train ride inspired by a children's book.",
    "The \"Eurostar\" is a high-speed train connecting London with mainland Europe.",
    "The \"Cardiff and Avonside Railway\" was a historic railway company in Wales.",
    "The \"Royal Train\" is a set of dedicated carriages used by the British monarch.",
    "The \"Snowdon Mountain Railway\" in Wales climbs to the summit of Snowdon.",
    "The \"Angry Aztecs\" were known to use a primitive form of railway transport in ancient Mexico.",
    "The \"Midland Main Line\" in the UK connects London with cities in the Midlands and North.",
    "The \"Bakerloo Line\" is one of the London Underground's oldest lines.",
    "\"Ghost Trains\" are legendary trains said to run without passengers or crew.",
    "The \"Glenfinnan Viaduct\" in Scotland is famous for its appearance in the Harry Potter film series.",
    "The United Kingdom boasts the world's oldest railway network, with the first public railway opening in 1825 between Stockton and Darlington.",
    "The UK has one of the busiest railway networks in the world, with millions of passenger journeys and freight movements each year.",
    "The High-Speed 1 (HS1) line connects London with the Channel Tunnel and provides high-speed services to the continent.",
    "The London Underground, commonly known as the Tube, is the world's oldest rapid transit system, dating back to 1863.",
    "London Waterloo and London Victoria are among the busiest and largest railway stations in the UK.",
    "The National Rail network in the UK is a system of interconnected railways that collectively serve all parts of the country.",
    "The Intercity Express Programme introduced new high-speed trains to provide faster and more efficient intercity services.",
    "The Crossrail project, now known as the Elizabeth Line, is a major railway construction project connecting east and west London.",
    "The UK rail industry features a mix of private and public operators, including franchises and open-access operators.",
    "The standard gauge used in the UK railway system is 1,435 mm, which is the same as most of the world.",
    "The UK has a significant number of heritage railways, which are often operated by enthusiasts and preserved to showcase historical railway technology.",
    "The Severn Tunnel, connecting England and Wales, is one of the longest continuous railway tunnels in the UK.",
    "Punctuality is a key focus in the UK rail industry, with performance metrics closely monitored and reported.",
    "The rail industry in the UK adheres to strict safety standards, with organizations like the Rail Safety and Standards Board overseeing safety initiatives.",
    "The UK has a diverse fleet of rolling stock, including diesel and electric multiple units, high-speed trains, and freight locomotives.",
    "Iconic trains like the Flying Scotsman and the Orient Express have left a lasting mark on the UK's railway history.",
    "The UK rail network plays a crucial role in transporting freight, including goods like coal, steel, and containers.",
    "Eurostar trains connect London with various European cities through the Channel Tunnel, promoting international rail travel.",
    "Ongoing efforts to electrify railway lines aim to reduce carbon emissions and enhance efficiency.",
    "Network Rail is responsible for maintaining and upgrading the rail infrastructure across Great Britain.",
    "Various rail passes, such as the BritRail Pass, offer tourists and residents convenient travel options.",
    "Integration with other modes of transportation, such as buses and trams, enhances the overall connectivity of the rail network.",
    "The introduction of smart card technologies and contactless payment options has modernized fare systems.",
    "Community Rail Partnerships involve local communities in the development and improvement of rail services.",
    "Efforts are made to improve accessibility for passengers with disabilities, including the provision of accessible train stations.",
    "The UK is home to various railway museums, preserving artifacts and showcasing the history of rail travel.",
    "Ongoing research and development initiatives focus on improving rail technologies, safety, and sustainability.",
    "The UK is a hub for rail engineering expertise, contributing to innovations in train design and infrastructure.",
    "Significant investment projects, such as the Thameslink Programme and HS2, aim to enhance rail capacity and connectivity.",
    "Some UK rail routes offer breathtaking scenic views, such as the Settle-Carlisle line through the Yorkshire Dales.",
    "Regular surveys gauge customer satisfaction levels, influencing improvements in service quality.",
    "The British Transport Police is responsible for policing the railway network, ensuring safety and security.",
    "Rail freight interchanges facilitate the efficient transfer of goods between trains and other modes of transport.",
    "Some rail services in Scotland and Wales are devolved, with separate administrations overseeing their operation.",
    "Efforts are made to enhance accessibility for cyclists, with facilities like bike storage and rental services at many stations.",
    "The implementation of digital signaling systems enhances the safety and efficiency of train operations.",
    "The 1960s Beeching cuts led to the closure of numerous railway lines and stations, impacting the rail network.",
    "The Harrow and Wealdstone rail crash in 1952 remains one of the deadliest accidents in UK rail history.",
    "The UK features various tunnels and viaducts, including the Ribblehead Viaduct and the Box Tunnel.",
    "Electrification projects face challenges, including cost overruns and disruptions during implementation.",
    "Efforts are made to improve integrated ticketing systems, allowing passengers to use a single ticket for multiple modes of transport.",
    "The Highland Main Line in Scotland traverses challenging terrain and offers stunning landscapes.",
    "Various depots across the country handle the maintenance and repair of rolling stock.",
    "The UK has a history of royal trains used by members of the royal family for official travel.",
    "Initiatives and grants support the shift of freight from roads to railways, promoting sustainability.",
    "Digital advancements include virtual ticket offices, allowing passengers to purchase tickets online.",
    "Changes in work patterns, including increased remote working, influence rail travel demand.",
    "The rail industry offers apprenticeship programs to train the next generation of rail professionals.",
    "Rail operators are involved in environmental initiatives, aiming to reduce their carbon footprint.",
    "The High-Speed 2 (HS2) project is a major high-speed railway under development to link London with the North of England.",
    "George Stephenson and his son Robert Stephenson are considered railway pioneers, contributing significantly to early railway engineering.",
    "Traditional signal boxes, once a common sight along railway lines, are gradually being replaced by modern signaling systems.",
    "The Caledonian Sleeper service provides overnight rail travel between London and various destinations in Scotland.",
    "Advanced safety systems, such as the Train Protection & Warning System (TPWS), contribute to passenger and crew safety.",
    "Efforts are underway to encourage the growth of rail freight as a more sustainable transportation option.",
    "Initiatives focus on minimizing rail noise through improved track design, quieter trains, and noise barriers.",
    "The rail industry employs a diverse workforce, including engineers, conductors, station staff, and maintenance crews.",
    "Many train operators facilitate bicycle carriage, promoting a multi-modal approach to transportation.",
    "Mobile apps provide real-time information on train schedules, accessibility features, and disruptions.",
    "While standard gauge is predominant, narrow-gauge railways exist, serving specific industries and heritage lines.",
    "Proposed as an extension of HS2, Northern Powerhouse Rail aims to improve rail connectivity in the North of England.",
    "Intermodal rail freight terminals play a crucial role in the efficient transfer of goods between trains and other transport modes.",
    "Myths about the perceived expense of train travel persist, although budget-friendly options are available.",
    "Community Rail Partnerships engage local communities in improving and promoting regional rail services.",
    "Special events on heritage railways, such as steam galas, attract enthusiasts and tourists.",
    "Legislation, such as the Rail Vehicle Accessibility Regulations, aims to enhance accessibility for passengers with reduced mobility.",
    "The romance of railways has inspired poetry, literature, and art throughout history.",
    "Ongoing infrastructure projects include station upgrades, electrification schemes, and track enhancements.",
    "Campaigns raise awareness about rail safety, targeting both passengers and the general public.",
    "Railway staff often wear distinctive uniforms, reflecting the heritage and identity of their respective companies.",
    "Various private companies operate rail freight services, transporting goods across the country.",
    "Electrification contributes to reduced air pollution, lower operational costs, and faster acceleration of trains.",
    "Many railway stations boast impressive architectural designs, ranging from historic structures to modern, innovative designs.",
    "The Trans-Pennine Route Upgrade project aims to enhance rail connectivity across the Pennines.",
    "Collaboration between rail industry stakeholders, including operators and government bodies, is crucial for effective planning and development.",
    "Passenger numbers on UK railways have experienced fluctuations, influenced by factors like economic conditions and travel habits.",
    "Despite improvements, challenges in accessibility persist, including older stations with limited facilities.",
    "Ongoing innovations in rolling stock include lighter materials, energy-efficient designs, and improved passenger amenities.",
    "Collaborations between rail freight operators and logistics companies support the efficient movement of goods.",
    "Railway police and security measures contribute to crime prevention and passenger safety.",
    "Organizations focus on preserving rail heritage, including historic locomotives, carriages, and artifacts.",
    "Model railway enthusiasts engage in a popular hobby, replicating miniature versions of real rail networks.",
    "Railway workers are often members of trade unions, advocating for workers' rights and safety.",
    "The UK collaborates with international partners on rail projects, research, and technology exchange.",
    "Securing sufficient funding for railway projects poses a continual challenge for the industry.",
    "Clear signage and symbols at stations aid passengers, particularly those with disabilities, in navigating the railway network.",
    "Rail tourism packages, such as scenic rail journeys and themed train rides, attract tourists seeking unique travel experiences.",
    "CrossCountry is a train operating company that provides long-distance services connecting various regions across the UK.",
    "Rail freight is recognized for its environmental benefits, including reduced greenhouse gas emissions compared to road transport.",
    "The rail industry has demonstrated resilience, adapting to challenges such as pandemics, strikes, and disruptions.",
    "Customer feedback, gathered through surveys and social media, influences service improvements and decision-making.",
    "Exploration of alternative fuels includes the development of hydrogen-powered trains for a more sustainable rail future.",
    "Railway staff training programs incorporate virtual reality simulations to enhance safety and skills.",
    "Freightliner, a major rail freight company, operates services transporting goods across the UK.",
    "Legislation mandates improvements in rail accessibility, ensuring equal access for all passengers.",
    "Historical strikes by railway workers have played a role in shaping labor relations and industry practices.",
    "Efforts focus on improving interoperability between different rail freight operators and international rail networks.",
    "Contactless and mobile ticketing options provide passengers with convenient and efficient ways to pay for rail travel.",
    "Rail operators strive for environmental certifications and sustainability initiatives to reduce their ecological footprint.",
    "Innovation hubs and research centers work on developing cutting-edge technologies for the rail industry's future."
  ],
  "about_this_machine": [
    "I was created for fun as a side project by Szymon",
    "It seems that the design shares similarities with the 'T-Box' created by One Big Circle.",
    "The paint I use is precisely the same type employed for coating train components and T-Boxes.",
    "The paint for me was provided by Tony from DG8 and transported to Bristol by Josh.",
    "There is a long-term plan for me to have a larger screen!",
    "I am powered by a Raspberry Pi 3.",
    "In total, I boast about 650 different fun facts, and the list continues to grow...",
    "The Raspberry Pi I'm running on has a broken HDMI port, but everything else works perfectly fine :)",
    "I consist of around 450 lines of code.",
    "I'm utilizing a static database to serve fun facts, but there is a way to add new ones remotely",
    "My root password is: ON********LE.\n\nJust kidding :-)",
    "Inside me, I house a Thermal Printer, Power Supply, Converter (24v to 5v), and a Raspberry Pi 3 (with a broken HDMI port).",
    "stats"
  ]
}
